# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
#  и проверяет, является ли этот день выходным.



new = int(input('Введите число дня недели '))

def find(namber):
    day = ['понедельник', 'вторник', 'среда', 'четверг', 'пятница', 'суббота', 'воскресенье']
    if namber<1 or namber>7:
        print ('введено некорректное число')
    elif namber>=6:
        print(f'{day[namber-1]} - выходной')
    else:
        print(f'{day[namber-1]}')

find(new)